---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.LoadTablePerPortion
enum: Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule
source: html/7fa26a3f-1640-4497-c60d-ac7af7624bb7.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.LoadTablePerPortion

This rule will apply the demand factor differently for each row in the table.
 For example, the 3000kVA will have a 100% demand factor applied, the next 9000 will have a 35% factor applied,
 and the remaining items will have a 25% factor applied.